{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Alopecurus Pratensis",
    "1": "Bifurcated Skeleton",
    "2": "Biting Box",
    "3": "Bogeyman",
    "4": "Cicada Wings",
    "5": "Clawed Pendulum",
    "6": "Esoteric Bones",
    "7": "Fruit of Good and Evil",
    "8": "Glowing Mothwing",
    "9": "Golden Beetle",
    "10": "Golden Bell Essence Bottle",
    "11": "Golden Compass",
    "12": "Golden Fleece",
    "13": "Golden Herb Incense",
    "14": "Goose Neck",
    "15": "Heartfelt Easter Egg",
    "16": "Holy Silver",
    "17": "Incorrupt Monkeypaw",
    "18": "Jadeite Tablet",
    "19": "Liquefied Terror",
    "20": "Magnesia Crystal",
    "21": "Milled Magnesia",
    "22": "Mistilteinn",
    "23": "Murmur of Insanity",
    "24": "Perpetual Cog",
    "25": "Platinum Ouija",
    "26": "Prophetic Bird",
    "27": "Pyroxene Ore",
    "28": "Red Lacquer Tablet",
    "29": "Rhine Gold",
    "30": "Roaming Terror Hut",
    "31": "Rootbox Rabbit",
    "32": "Rough Silver Ingot",
    "33": "Salted Mandrake",
    "34": "Serpent Scepter",
    "35": "Sharp Needle",
    "36": "Shattered Bones",
    "37": "Silver Bullet",
    "38": "Silver Ore",
    "39": "Solidus",
    "40": "Spell of Banishing",
    "41": "Spell of Fortune",
    "42": "Trembling Tooth",
    "43": "Watch Core",
    "44": "Winged Key",
    "45": "Wyrmling Skeleton"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Alopecurus Pratensis": "0",
    "Bifurcated Skeleton": "1",
    "Biting Box": "2",
    "Bogeyman": "3",
    "Cicada Wings": "4",
    "Clawed Pendulum": "5",
    "Esoteric Bones": "6",
    "Fruit of Good and Evil": "7",
    "Glowing Mothwing": "8",
    "Golden Beetle": "9",
    "Golden Bell Essence Bottle": "10",
    "Golden Compass": "11",
    "Golden Fleece": "12",
    "Golden Herb Incense": "13",
    "Goose Neck": "14",
    "Heartfelt Easter Egg": "15",
    "Holy Silver": "16",
    "Incorrupt Monkeypaw": "17",
    "Jadeite Tablet": "18",
    "Liquefied Terror": "19",
    "Magnesia Crystal": "20",
    "Milled Magnesia": "21",
    "Mistilteinn": "22",
    "Murmur Of Insanity": "23",
    "Perpetual Cog": "24",
    "Platinum Ouija": "25",
    "Prophetic Bird": "26",
    "Pyroxene Ore": "27",
    "Red Lacquer Tablet": "28",
    "Rhine Gold": "29",
    "Roaming Terror Hut": "30",
    "Rootbox Rabbit": "31",
    "Rough Silver Ingot": "32",
    "Salted Mandrake": "33",
    "Serpent Scepter": "34",
    "Sharp Needle": "35",
    "Shattered Bones": "36",
    "Silver Bullet": "37",
    "Silver Ore": "38",
    "Solidus": "39",
    "Spell of Banishing": "40",
    "Spell of Fortune": "41",
    "Trembling Tooth": "42",
    "Watch Core": "43",
    "Winged Key": "44",
    "Wyrmling Skeleton": "45"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.6",
  "use_cache": false
}